base/DataProcessors/бит_ГрупповаяОплатаЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ГрупповаяОплатаЗаявок</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъединятьНазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

base/Enums/бит_РежимыЗаписиДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_РежимыЗаписиДокумента</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запись</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проведение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Documents/бит_кзн_ЗаявкаНаРасходованиеСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_кзн_ЗаявкаНаРасходованиеСредств</Name>
			<Comment>(БИТ)</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УдалитьХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОперацийКазначейства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СценарииПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКурсДокумента</Name>
					<Comment>Курс документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКратностьДокумента</Name>
					<Comment>Кратность документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежаУпр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлана</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_кзн_ВидыПланов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_ДополнительныеУсловияПоДоговору</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_пз_ЗаявкаНаЗатраты</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПереработчика</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_пз_СводнаяЗаявкаНаЗатраты</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПереработчика2_5</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаРасходованиеСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленНаСогласование</Name>
					<Comment>Признак того, что работа с документом завершена и он отправлен на согласование. Используется только в режиме "Проводить документы после утверждения".</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_Важность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СверхБюджета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежиПо275ФЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорСЗаказчиком</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктКонтрактаПредмета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктКонтрактаОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыКонтроляОплатыПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПлатежаФЗ275</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПлатежейФЗ275</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорСУчастникомГОЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписатьЛимиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланированиеСуммы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПланированияОплатыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОбъединятьПозицииПриОплате</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПодтверждающиеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыПодтверждающихДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентовПрисоединенныеФайлы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКредитовИДепозитовПрисоединенныеФайлы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДоговорыМеждуОрганизациямиПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/DataProcessors/бит_ГрупповаяОплатаЗаявок/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "АвтоТест", Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Параметры.Позиции) Тогда
		ТекстСообщения = НСтр("ru = 'Непосредственное открытие этой формы не предусмотрено.';
								|en = 'You can''t open this form directly.'");
    	ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	// Стандартные действия при создании на сервере
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	СписокСвойств = "ДатаОплаты, Позиции, РежимЗаписиРасчетыЧерезБанк, РежимЗаписиРасчетыЧерезКассу, ВызовИзРеестра";
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, СписокСвойств);
	
	Если НЕ ЗначениеЗаполнено(РежимЗаписиРасчетыЧерезБанк) Тогда	
		РежимЗаписиРасчетыЧерезБанк = Перечисления.бит_РежимыЗаписиДокумента.Запись;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(РежимЗаписиРасчетыЧерезКассу) Тогда	
		РежимЗаписиРасчетыЧерезКассу = Перечисления.бит_РежимыЗаписиДокумента.Запись;	
	КонецЕсли;
	
	Для каждого Элемент Из Параметры.Позиции Цикл
		ЗаполнитьЗначенияСвойств(ДокументыДляОбработки.Добавить(), Элемент);
	КонецЦикла;
	
	ОбновитьДеревоДокументов();
	
	НастройкиФормы = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Обработки.бит_ГрупповаяОплатаЗаявок",
						"НастройкиФормы", СохраняемыеНастройки(ЭтотОбъект));
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиФормы);
	
	// Настроим отображение полей доп. аналитик в дереве Дерево позиций.
    ИзмеренияДоп = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные", "Синоним");
    НастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияВТабличномПоле(ЭтотОбъект, "ДеревоДокументов",
		ИзмеренияДоп, НастройкиИзмерений);
		
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РазвернутьДоУровня();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НЕ ЗавершениеРаботы Тогда			
		ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("Обработки.бит_ГрупповаяОплатаЗаявок",
			"НастройкиФормы", СохраняемыеНастройки(ЭтотОбъект));
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоДокументов

&НаКлиенте
Процедура ДеревоДокументовВыполнятьПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ДеревоДокументов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Выполнять = 2 Тогда
		ТекущиеДанные.Выполнять = 0;
	КонецЕсли;
	
	ЗначениеФлажка = ТекущиеДанные.Выполнять;
	
	ИзменитьФлажки(ТекущиеДанные.ПолучитьЭлементы(), ЗначениеФлажка);
	
	ИзменитьФлажкиРодителей(ТекущиеДанные.ПолучитьРодителя(), ТекущиеДанные.ПолучитьРодителя(), ЗначениеФлажка, ЗначениеФлажка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ДеревоДокументов.ТекущиеДанные;	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКолонки = СтрЗаменить(Поле.Имя, "ДеревоДокументов", "");
	
	ПоказатьЗначение(,ТекущиеДанные[ИмяКолонки]);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	ОбновитьДеревоДокументов();
	РазвернутьДоУровня();

КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьФлажки(Команда)
	
	ИзменитьФлажки(ДеревоДокументов.ПолучитьЭлементы(), 1);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьФлажки(Команда)
	
	ИзменитьФлажки(ДеревоДокументов.ПолучитьЭлементы(), 0);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьДокументыОплаты(Команда)
	
	ЭлементыДерева = ДеревоДокументов.ПолучитьЭлементы();
	
	ЕстьДокументыДляОплаты = Ложь;
	
	Для Каждого ТекущаяСтрока Из ЭлементыДерева Цикл
		Если ТекущаяСтрока.Выполнять <> 0 Тогда
			ЕстьДокументыДляОплаты = Истина;
            Прервать;
		КонецЕсли;
	КонецЦикла;
    
    Если ЕстьДокументыДляОплаты Тогда
		СоздатьДокументыОплаты();
	Иначе		
		ТекстСообщения = НСтр("ru='Нет платежных позиций отмеченных для оплаты.';en='No payment positions marked for payment.'");
		ПоказатьПредупреждение(, ТекстСообщения,, НСтр("ru='Создать документы';en='Create Documents'"));
    КонецЕсли;
    	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНастройки(Команда)
	
	ПараметрыПередачи = Новый Структура; 
	ПараметрыПередачи.Вставить("ОбъединятьНазначениеПлатежа", ОбъединятьНазначениеПлатежа);
	ПараметрыПередачи.Вставить("РежимЗаписиРасчетыЧерезБанк", РежимЗаписиРасчетыЧерезБанк);
	ПараметрыПередачи.Вставить("РежимЗаписиРасчетыЧерезКассу",РежимЗаписиРасчетыЧерезКассу);
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьНастройкиОкончание", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.бит_ГрупповаяОплатаЗаявок.Форма.Настройка", ПараметрыПередачи, 
		ЭтотОбъект, ЭтотОбъект,,,Оповещение);
	
КонецПроцедуры

// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
//
&НаКлиенте
Процедура ОткрытьНастройкиОкончание(Результат, Дополнительно) Экспорт

	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;	
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Результат);
	РазвернутьДоУровня();
	
КонецПроцедуры
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ФормированиеДереваПозиций

&НаСервере
Процедура ОбновитьДеревоДокументов()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументыДляОбработки", РеквизитФормыВЗначение("ДокументыДляОбработки"));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументыДляОбработки.ПлатежнаяПозиция КАК ПлатежнаяПозиция,
	|	ДокументыДляОбработки.СуммаКОплате КАК СуммаКОплате
	|ПОМЕСТИТЬ ДокументыДляОбработки
	|ИЗ
	|	&ДокументыДляОбработки КАК ДокументыДляОбработки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПлатежныеПозиции.Ссылка КАК ПлатежнаяПозиция,
	|	ПлатежныеПозиции.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ПлатежныеПозиции.Организация КАК Организация,
	|	ПлатежныеПозиции.БанковскийСчет КАК БанковскийСчет,
	|	ВЫБОР
	|		КОГДА ПлатежныеПозиции.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ПлатежныеПозиции.Контрагент
	|		КОГДА ПлатежныеПозиции.ФизЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА ПлатежныеПозиции.ФизЛицо
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Контрагент,
	|	ПлатежныеПозиции.ДатаПлан КАК ДатаПлан,
	|	ПлатежныеПозиции.ДатаПланКрайняя КАК ДатаПланКрайняя,
	|	ПлатежныеПозиции.ВалютаДокумента КАК Валюта,
	|	ПлатежныеПозиции.ДокументПланирования КАК Заявка,
	|	ПлатежныеПозиции.СтатьяОборотов КАК СтатьяОборотов,
	|	ПлатежныеПозиции.ЦФО КАК ЦФО,
	|	ПлатежныеПозиции.Аналитика_1 КАК Аналитика_1,
	|	ПлатежныеПозиции.Аналитика_2 КАК Аналитика_2,
	|	ПлатежныеПозиции.Аналитика_3 КАК Аналитика_3,
	|	ПлатежныеПозиции.Аналитика_4 КАК Аналитика_4,
	|	ПлатежныеПозиции.Аналитика_5 КАК Аналитика_5,
	|	ПлатежныеПозиции.Аналитика_6 КАК Аналитика_6,
	|	ПлатежныеПозиции.Аналитика_7 КАК Аналитика_7,
	|	ПлатежныеПозиции.Аналитика_8 КАК Аналитика_8,
	|	ПлатежныеПозиции.Аналитика_9 КАК Аналитика_9,
	|	ПлатежныеПозиции.Аналитика_10 КАК Аналитика_10,
	|	ПлатежныеПозиции.Аналитика_11 КАК Аналитика_11,
	|	ПлатежныеПозиции.Аналитика_12 КАК Аналитика_12,
	|	1 КАК Выполнять,
	|	ДокументыДляОбработки.СуммаКОплате КАК СуммаКОплате,
	|	ПлатежныеПозиции.Подразделение КАК Подразделение
	|ИЗ
	|	Документ.бит_кзн_ПлатежнаяПозиция КАК ПлатежныеПозиции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыДляОбработки КАК ДокументыДляОбработки
	|		ПО ПлатежныеПозиции.Ссылка = ДокументыДляОбработки.ПлатежнаяПозиция
	|ИТОГИ ПО
	|	ХозяйственнаяОперация,
	|	Организация,
	|	БанковскийСчет,
	|	Контрагент,
	|	Подразделение";
	
	ДеревоДляВывода = РеквизитФормыВЗначение("ДеревоДокументов");
	ДеревоДляВывода.Строки.Очистить();
	
	Результат = Запрос.Выполнить();
	
	ОбойтиВыборкуЗапроса(Результат, ДеревоДляВывода);
	ЗначениеВРеквизитФормы(ДеревоДляВывода, "ДеревоДокументов");
	
КонецПроцедуры

&НаСервере
Процедура ОбойтиВыборкуЗапроса(РезультатЗапрос, ДеревоДляВывода)

	Выборка = РезультатЗапрос.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ТипЗаписи() = ТипЗаписиЗапроса.ИтогПоГруппировке Тогда
			Если ВывестиГруппировку(Выборка) Тогда
				СтрокаТаблицы = ДеревоДляВывода.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка, , "Валюта");
				
				СтрокаТаблицы.Группировка = Выборка[Выборка.Группировка()];
				СтрокаТаблицы.Выполнять   = 1;
			Иначе
				СтрокаТаблицы = ДеревоДляВывода;
			КонецЕсли;
		Иначе
			СтрокаТаблицы = ДеревоДляВывода.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);
			
			СтрокаТаблицы.Группировка 		 = Выборка.ПлатежнаяПозиция;
			СтрокаТаблицы.ЦелеваяГруппировка = Истина;
			СтрокаТаблицы.Выполнять			 = 1;
			// См. группировки итогов в запросе ОбновитьДеревоДокументов().
			Ключи = ""
				+ "ХозяйственнаяОперация,"
				+ "Организация,"
				+ "БанковскийСчет,"
				+ "Контрагент,"
				+ "Подразделение";
			Данные = Новый Структура(Ключи);
			ЗаполнитьЗначенияСвойств(Данные, Выборка);
			
			СтрокаТаблицы.НомерГруппы = ОбщегоНазначения.КонтрольнаяСуммаСтрокой(Данные);
		КонецЕсли; 
		
		ОбойтиВыборкуЗапроса(Выборка, СтрокаТаблицы);
	КонецЦикла; 

КонецПроцедуры

&НаСервере
Функция ВывестиГруппировку(Выборка)
	
	ВывестиГруппировку = Истина;

	Возврат ВывестиГруппировку;
	
КонецФункции

#КонецОбласти

#Область ИзменениеФлажков

&НаКлиенте
Процедура ИзменитьФлажки(ЭлементыДерева, ЗначениеФлажка)
	
	Для Каждого ТекущаяВетка Из ЭлементыДерева Цикл
		ТекущаяВетка.Выполнять = ЗначениеФлажка;
		ИзменитьФлажки(ТекущаяВетка.ПолучитьЭлементы(), ЗначениеФлажка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФлажкиРодителей(ВеткаРодитель, Ветка, ЗначениеФлажка, СостояниеРодителя)
	
	Если Ветка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементыРодителя = Ветка.ПолучитьЭлементы();
	
	Для Каждого ТекущаяВетка Из ЭлементыРодителя Цикл
		Если НЕ ТекущаяВетка.Выполнять = ЗначениеФлажка Тогда
			СостояниеРодителя = 2;
			Прервать;
		КонецЕсли;
		ИзменитьФлажкиРодителей(ВеткаРодитель, ТекущаяВетка, ЗначениеФлажка, СостояниеРодителя);
		Если СостояниеРодителя = 2 Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ВеткаРодитель = Ветка Тогда
		ВеткаРодитель.Выполнять = СостояниеРодителя;
		ИзменитьФлажкиРодителей(ВеткаРодитель.ПолучитьРодителя(), ВеткаРодитель.ПолучитьРодителя(), ЗначениеФлажка, ЗначениеФлажка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СозданиеДокументовОплаты

&НаКлиенте
Процедура СоздатьДокументыОплаты()
	
	АдресВХранилище = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
    СоздатьДокументыОплатыСервер(АдресВХранилище);
	
    Закрыть(АдресВХранилище);
	
КонецПроцедуры

//  Процедура создает документы оплаты по выделенным позициям. Выполняется рекурсивно.
//
// Параметры:
//  МассивСозданных - Массив.
//  ДеревоПоз.
//
&НаСервере
Процедура СоздатьДокументыОплатыСервер(АдресВХранилище, ДеревоПоз = Неопределено)

	ПараметрыДокументов = Новый Массив;
	
	Если ДеревоПоз <> Неопределено Тогда
		СтрокиДерева = ДеревоПоз.ПолучитьЭлементы();
	Иначе 
		СтрокиДерева = ДеревоДокументов.ПолучитьЭлементы();
	КонецЕсли; 
	
	НовыйДокумент = Истина;
	
	Для Каждого ТекущаяСтрока Из СтрокиДерева Цикл
		
		Если ТекущаяСтрока.Выполнять = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ТекущаяСтрока.Группировка) = Тип("ДокументСсылка.бит_кзн_ПлатежнаяПозиция")
			И ТекущаяСтрока.Выполнять = 1 Тогда
			
			Если НовыйДокумент Тогда
				ДанныеЗаполнения = Документы.бит_кзн_ЗаявкаНаРасходованиеСредств.НовыеПараметрыДокументаСоздатьПлатежныеДокументы();
				ДанныеЗаполнения.Дата 						 = ДатаОплаты;
				ДанныеЗаполнения.БанковскийСчетКасса		 = ТекущаяСтрока.БанковскийСчет;
				ДанныеЗаполнения.ОбъединятьНазначениеПлатежа = ОбъединятьНазначениеПлатежа;
				ДанныеЗаполнения.РежимЗаписи				 = РежимЗаписиРасчетыЧерезБанк;
				ДанныеЗаполнения.ВызовИзРеестра				 = ВызовИзРеестра;
				
				НоваяСтрока = ДанныеЗаполнения.Позиции.Добавить();
				НоваяСтрока.Позиция  = ТекущаяСтрока.Группировка;
				НоваяСтрока.Сумма    = ТекущаяСтрока.СуммаКОплате;
				ДокументПланирования = ТекущаяСтрока.Группировка.ДокументПланирования;
				
				НовыйДокумент = Ложь;
			Иначе
				ПозицияСумма = Новый Структура("Позиция, Сумма", 
									ТекущаяСтрока.Группировка, ТекущаяСтрока.СуммаКОплате);
				ЗаполнитьЗначенияСвойств(ДанныеЗаполнения.Позиции.Добавить(), ПозицияСумма);
			КонецЕсли;
		Иначе
			СоздатьДокументыОплатыСервер(АдресВХранилище, ТекущаяСтрока);
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ НовыйДокумент Тогда
	
		ПараметрыДокументов.Добавить(ДанныеЗаполнения);

		Результат = Документы.бит_кзн_ЗаявкаНаРасходованиеСредств.СоздатьПлатежныеДокументы(
						ДокументПланирования, ПараметрыДокументов); 
						
		НакопленныйРезультат = ПолучитьИзВременногоХранилища(АдресВХранилище);
		Если ЗначениеЗаполнено(НакопленныйРезультат) Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Результат, НакопленныйРезультат);
		Иначе	
			НакопленныйРезультат = Результат;
		КонецЕсли;
		ПоместитьВоВременноеХранилище(НакопленныйРезультат, АдресВХранилище);				
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

&НаКлиентеНаСервереБезКонтекста
Функция СохраняемыеНастройки(Форма)
	
	Настройки = Новый Структура; 
	Настройки.Вставить("ОбъединятьНазначениеПлатежа", Ложь);
	Настройки.Вставить("МаксУровеньДеревоСчета", 5);

	ЗаполнитьЗначенияСвойств(Настройки, Форма);
	
	Возврат Настройки;

КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоДокументов");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"ДеревоДокументов.ЦелеваяГруппировка", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.бит_ЦветФонаГруппыИтоги);
		
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДоУровня()

	Уровень = ?(МаксУровеньДеревоСчета = 0, 11, МаксУровеньДеревоСчета);
	бит_РаботаСДиалогамиКлиент.РазвернутьДоУровня(Элементы.ДеревоДокументов,ДеревоДокументов, Уровень);
	
КонецПроцедуры

#КонецОбласти
